In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "temperature": [32,45,30],
    "humidity": [80,60,78]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [25,30,35],
    "humidity": [68,65,75]
})
us_weather

       city  humidity  temperature
0  new york        68           25
1   chicago        65           30
2   orlando        75           35

In [3]:
df = pd.concat([india_weather, us_weather])
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
0  new york        68           25
1   chicago        65           30
2   orlando        75           35

In [4]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           25
4   chicago        65           30
5   orlando        75           35

In [5]:
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           30
us    0  new york        68           25
      1   chicago        65           30
      2   orlando        75           35

In [6]:
df.loc["us"]

       city  humidity  temperature
0  new york        68           25
1   chicago        65           30
2   orlando        75           35

In [20]:
temperature_df = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [25,30,35],
}, index=[0,1,2])
temperature_df

       city  temperature
0  new york           25
1   chicago           30
2   orlando           35

In [22]:
windspeed_df = pd.DataFrame({
    "city": ["orlando", "chicago", "new york"],
    "windspeed": [7,12,9],
}, index=[2,1,0])
windspeed_df

       city  windspeed
2   orlando          7
1   chicago         12
0  new york          9

In [23]:
df = pd.concat([temperature_df, windspeed_df], axis=1)
df

       city  temperature      city  windspeed
0  new york           25  new york          9
1   chicago           30   chicago         12
2   orlando           35   orlando          7

In [24]:
temperature_df

       city  temperature
0  new york           25
1   chicago           30
2   orlando           35

In [25]:
s = pd.Series(["Humid", "Dry", "Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [27]:
df = pd.concat([temperature_df, s],axis=1)
df

       city  temperature  event
0  new york           25  Humid
1   chicago           30    Dry
2   orlando           35   Rain